read_verilog detector_k285.v
hierarchy -check -top detector_k285
proc;
opt;
fsm;
opt;
memory;
opt;
techmap;
opt;
write_verilog rtlil.v
dfflibmap -liberty cmos_cells.lib;
abc -liberty cmos_cells.lib;
clean
write_verilog DK_sintetizado.v
