read_verilog mux.v
hierarchy -check -top mux
proc;
opt;
fsm;
opt;
memory;
opt;
techmap;
opt;
write_verilog rtlil.v
dfflibmap -liberty cmos_cells.lib;
abc -liberty cmos_cells.lib;
clean
write_verilog mux_sintetizado.v
